cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'caskroom/versions'

# Terminal

brew 'awscli'
brew 'certbot'
brew 'coreutils'
brew 'docker'
brew 'docker-machine'
brew 'git'
brew 'gnupg'
brew 'keybase'
brew 'leiningen'
#brew 'mas', args: ['force-bottle']
brew 'node'
brew 'shellcheck'
brew 'sysdig'
brew 'trash'
brew 'tree'
brew 'xz'

# Mac Applications

cask '1password'
cask 'appcleaner'
cask 'banktivity'
cask 'caffeine'
cask 'cyberduck'
cask 'daisydisk'
#mas 'dash', id: 449589707
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'flux'
cask 'focus'
cask 'google-chrome'
cask 'handbrake'
cask 'java'
cask 'omnifocus'
#mas 'pocket', id: 568494494
#mas 'pomodoro-one', id: 907364780
cask 'processing'
cask 'skype'
cask 'sonos'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'the-unarchiver'
cask 'transmission'
#mas 'twitter', id: 409789998
cask 'virtualbox'
cask 'vlc'
