cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'

# Terminal

brew 'bash'
brew 'bash-completion@2'
brew 'coreutils'
brew 'git'
brew 'tmux'
brew 'tree'

# Mac Applications

cask '1password'
cask 'appcleaner'
cask 'caffeine'
cask 'dropbox'
cask 'emacs'
cask 'firefox'
cask 'google-chrome'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'spotify'
cask 'rectangle'
