cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'caskroom/cask'

# Terminal

brew 'bash'
brew 'bash-completion@2'
brew 'cask'
brew 'coreutils'
brew 'git'
brew 'tmux'
brew 'tree'

# Mac Applications

cask '1password'
cask 'appcleaner'
cask 'caffeine'
cask 'dropbox'
cask 'emacs'
cask 'firefox'
cask 'flux'
cask 'java'
cask 'omnifocus'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
