cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'caskroom/versions'

# Terminal

brew 'ant'
brew 'awscli'
brew 'bash'
brew 'bash-completion2'
brew 'coreutils'
brew 'docker'
brew 'docker-machine'
brew 'dockutil'
brew 'emacs', args: ['with-cocoa', 'with-gnutls', 'devel']
brew 'emscripten', args: ['with-closure-compiler']
brew 'git'
brew 'gnupg'
brew 'ffmpeg'
brew 'keybase'
brew 'leiningen'
brew 'mas', args: ['force-bottle']
brew 'node'
brew 'python'
brew 'rbenv'
brew 'librsvg'
brew 'rlwrap'
brew 'shellcheck'
brew 'sysdig'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'xz'

# Mac Applications

cask '1password'
mas 'airmail', id: 918858936
cask 'appcleaner'
cask 'atom'
cask 'banktivity'
cask 'bbc-iplayer-downloads'
cask 'blender'
cask 'caffeine'
cask 'context-free'
cask 'cura'
cask 'cyberduck'
cask 'daisydisk'
mas 'dash', id: 449589707
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'handbrake'
cask 'inkscape'
cask 'istat-menus'
cask 'istumbler'
cask 'java'
cask 'little-snitch'
cask 'luxrender'
cask 'omnifocus'
cask 'meshlab'
mas 'pocket', id: 568494494
mas 'pomodoro-one', id: 907364780
cask 'processing'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'skype'
cask 'slack'
cask 'sonos'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'the-unarchiver'
cask 'transmission'
cask 'tripmode'
mas 'twitter', id: 409789998
cask 'virtualbox'
cask 'vlc'
cask 'vnc-viewer'
cask 'xquartz'
