cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'caskroom/versions'

# Terminal

brew 'bash'
brew 'bash-completion2'
brew 'cask'
brew 'coreutils'
brew 'dockutil'
brew 'emacs', args: ['head', 'with-cocoa', 'with-gnutls', 'devel']
brew 'git'
brew 'gnupg'
brew 'leiningen'
brew 'librsvg'
brew 'mas', args: ['force-bottle']
brew 'node'
brew 'pandoc'
brew 'python'
brew 'rbenv'
brew 'tmux'
brew 'tree'
brew 'xz'

# Mac Applications

cask '1password'
cask 'appcleaner'
cask 'atom'
cask 'basictex'
cask 'blender'
cask 'caffeine'
cask 'cura'
cask 'cyberduck'
cask 'daisydisk'
cask 'dash'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-drive'
cask 'handbrake'
cask 'inkscape'
cask 'istat-menus'
cask 'istumbler'
cask 'java'
cask 'little-snitch'
cask 'luxrender'
cask 'meshlab'
cask 'omnifocus'
cask 'openoffice'
mas 'pocket', id: 568494494
mas 'pomodoro-one', id: 907364780
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'skype'
cask 'slack'
cask 'sonos'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'texturepacker'
cask 'the-unarchiver'
cask 'transmission'
cask 'tripmode'
mas 'twitter', id: 409789998
cask 'vlc'
cask 'vmware-fusion'
cask 'vnc-viewer'
mas 'xcode', id: 497799835
cask 'xquartz'
