cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'caskroom/versions'

# Terminal

brew 'bash'
brew 'bash-completion2'
brew 'cask'
brew 'coreutils'
brew 'git'
brew 'gnupg'
brew 'mas', args: ['force-bottle']
brew 'python'
brew 'rbenv'
brew 'tmux'
brew 'tree'
brew 'xz'

# Mac Applications

cask '1password'
cask 'appcleaner'
cask 'atom'
cask 'caffeine'
cask 'cyberduck'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'emacs'
cask 'evernote'
cask 'fantastical'
cask 'firefox'
cask 'firefoxdeveloperedition'
cask 'flux'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'handbrake'
cask 'java'
cask 'omnifocus'
cask 'omnigraffle'
cask 'postman'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'skype'
cask 'slack'
cask 'sonos'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'
cask 'the-unarchiver'
mas 'tomato-one', id: 907364780
cask 'vagrant'
cask 'virtualbox'
cask 'vmware-fusion'
cask 'vnc-viewer'
# cask 'xquartz'
